{
    "clans": 
    [
        {
            "name": "Aburame",
            "chakra": 100,
            "description": "The Aburame Clan is one of the four noble clans of Konohagakure. At birth, members of this clan are offered to several special breeds of insects as a nest, residing just under their host's skin. These insects will then live in symbiosis with their host from that point on. Because of this, its members are characterised by their use of insects as weapons."
        },
        {
            "name": "Hyuga",
            "chakra": 200,
            "description": "The Hyūga Clan is one of the four noble clans of Konohagakure, as well as the strongest clan in the village.[2] All members born into this clan possess the Byakugan, a kekkei genkai that gives them extended fields of vision and the ability to see through solid objects and even the chakra circulatory system, amongst other things. Members of this clan also possess an innate ability which allows them to expel chakra from any of the tenketsu in their body."
        },
        {
            "name": "Inuzuka",
            "chakra": 100,
            "description": "The Inuzuka Clan or Inuzuka Family is a family of shinobi in Konohagakure known for their use of ninken as fighting companions and are easily identified by the distinctive red fang markings on their cheeks."
        },
        {
            "name": "Kurama",
            "chakra": 500,
            "description": "The Kurama Clan is a clan of extremely skilled genjutsu users, exclusive to the anime. This talent in genjutsu is due to the kekkei genkai that the clan possesses. However, once every few generations, a member of the clan will be born with such enormous skill in genjutsu that their illusions causes the brain to make anything that happens to the victim within the genjutsu physically real, allowing the clan member to potentially kill their opponents with genjutsu."
        },
        {
            "name": "Nara",
            "chakra": 100,
            "description": "The Nara Clan or Nara Family is one of the many clans of Konohagakure. They are known for tending deer and their ability to manipulate shadows through the use of Yin Release. Two of its members, Shikaku and his son Shikamaru, are well known for their high-level of intelligence, and both have served as advisors to the Hokage. After Shikaku's death, Shikamaru became the head of the clan."
        },
        {
            "name": "Otsutsuki",
            "chakra": 3000,
            "description": "The Ōtsutsuki Clan is an ancient clan of horned celestial beings. As a parasitic species they have spent thousands of years traversing the cosmos in order to carry out the Ōtsutsuki Will, a doctrine which dictates that clan members consume the life energy and genetic material of other worlds in order to continuously evolve, with the ultimate goal of attaining godhood. After the arrival of the clan's members on Earth a millennium ago, the Ōtsutsuki began having a lasting influence on the human population, notably starting the history of shinobi."
        },
        {
            "name": "Sarutobi",
            "chakra": 100,
            "description": "The Sarutobi Clan is an influential clan from Konohagakure. It has produced several renowned members who have held positions of high authority, including the Third Hokage; whose son, Asuma, held membership in the Twelve Guardian Ninja, while his other child served directly under the Hokage along with their spouse as Anbu. All known members have also been devout observers of the Will of Fire."
        },
        {
            "name": "Senju",
            "chakra": 1000,
            "description": "The Senju Clan was one of the clans responsible for founding the first shinobi village: Konohagakure — the other being their rival Uchiha clan. Although the clan itself no longer appears to exist as a group, the Senju continue to influence Konoha's politics through their philosophy of the Will of Fire and the corresponding interpretation of the role of the Hokage position. As such, three Senju have achieved the position of Hokage."
        },
        {
            "name": "Uchiha",
            "chakra": 1000,
            "description": "The Uchiha Clan is one of the four noble clans of Konohagakure, reputed to be the village's strongest because of their Sharingan and natural battle prowess. After helping found Konoha decades ago, the Uchiha grew increasingly isolated from the village's affairs, culminating in most of their deaths during the Uchiha Clan Downfall. Few Uchiha now survive into the present day."
        },
        {
            "name": "Uzumaki",
            "chakra": 5000,
            "description": "The Uzumaki Clan is formerly a prominent clan in Uzushiogakure. Since its disbandment, most of its known members reside in Konohagakure. Despite its demise, fifteen years after the Fourth Shinobi World War the clan is once again active."
        },
        {
            "name": "Yamanaka",
            "chakra": 100,
            "description": "The Yamanaka Clan is a family of shinobi found in Konohagakure. They specialise in mind related techniques, and they own and run a flower shop in the village. They traditionally lead the Konoha Barrier Team."
        }
    ],
    "ninjutsus": {
        "rasengan": {
            "name": "Rasengan",
            "cost": 80,
            "points": 6,
            "description": "The Rasengan requires extremely refined chakra control, something that very few ninja naturally possess. For this reason, the Rasengan is difficult to master."
        },
        "chidori": {
            "name": "Chidori",
            "cost": 40,
            "points": 3,
            "description": "To perform, the user first gathers lightning to their hand; the high concentration of electricity produces a sound reminiscent of many birds chirping, hence the name. The lightning chakra has been shown on occasions to damage the user's hand, peeling the skin and causing it to smoulder slightly, but this does not appear to actually be debilitating. Once the chakra is gathered, users charge at their target and thrust the Chidori into them, piercing them and typically causing fatal damage. Despite the sound it makes, the rapid speed at which it's used makes it useful for assassinations."
        }
    },
    "genjutsus": {
        "tsukuyomi": {
            "name": "Tsukuyomi",
            "cost": 30,
            "points": 10,
            "description": "Tsukuyomi's illusions are usually represented as an inverted grey scale; in the anime, there is usually also a red moon in a red sky. Because of the power of the Mangekyō Sharingan and the speed with which Tsukuyomi works, normal methods of countering genjutsu are ineffective against it."
        },
        "infinite tsukuyomi": {
            "name": "Infinite Tsukuyomi",
            "cost": 1000,
            "points": 100,
            "description": "Once cast, the penetrating light of the Infinite Tsukuyomi shines across the world, bright enough to dispel the night for as long as it is active. All those who fall under its gaze are trapped in the genjutsu, with the Rinnegan's design appearing in their eyes to represent its influence."
        }
    },
    "taijutsus": {
        "gentle fist": {
            "name": "Gentle Fist",
            "cost": 40,
            "points": 20,
            "description": "It inflicts internal damage through attacking the body's Chakra Pathway System, subsequently injuring organs which are closely intertwined with the area of the network which has been struck. To do this, the user surgically injects a certain amount of their own chakra into the opponent's chakra pathway system, causing damage to surrounding organs due to their proximity to the chakra circulatory system. Even the slightest tap can cause severe internal damage, hence the name \"gentle\" fist."
        },
        "one thousand years of death": {
            "name": "One Thousand Years of Death",
            "cost": 10,
            "points": 1,
            "description": "The user tightly clasps their hands together and extends their middle and index fingers, resembling the Tiger hand seal.[2] Using the full weight of their body, the user thrusts these four fingers between the target's buttocks. Despite the technique's dramatic name, it is not actually harmful."
        }
    }
}